---
kind: type
id: T:Autodesk.Revit.DB.BaseLoadOn
source: html/89ff9f32-0abe-ed50-b25b-3d0cc7c89689.htm
---
# Autodesk.Revit.DB.BaseLoadOn

An enumerated type listing all the possible power load use types for a space object.

## Syntax (C#)
```csharp
public enum BaseLoadOn
```